nxp-mcuxpresso/mcux-sdk-examples/mcxn9xxevk/azure_rtos_examples/azure_iot_embedded_sdk/cm33_core0/azure_iot_embedded_sdk.c
        if ((status = nx_azure_iot_hub_client_direct_method_message_response(&iothub_client, 200 /* method status */,
                                                                             context_ptr, context_length,
                                                                             (UCHAR *)method_response_payload, sizeof(method_response_payload) - 1,
                                                                             NX_WAIT_FOREVER)))
        {
            PRINTF("Direct method response failed!: error code = 0x%08x\r\n", status);
            nx_packet_release(packet_ptr);
            continue;
        }

        nx_packet_release(packet_ptr);
    }
}
#endif /* DISABLE_DIRECT_METHOD_SAMPLE */

#ifndef DISABLE_DEVICE_TWIN_SAMPLE
void sample_device_twin_thread_entry(ULONG parameter)
{
    UCHAR loop = NX_TRUE;
    NX_PACKET *packet_ptr;
    UINT status = 0;
    UINT response_status;
    UINT request_id;
    ULONG reported_property_version;

    NX_PARAMETER_NOT_USED(parameter);

    /* Loop to receive device twin message.  */
    while (loop)
    {
        if (sample_connection_status != NX_SUCCESS)
        {
            tx_thread_sleep(NX_IP_PERIODIC_RATE);
            continue;
        }

        /* Only one properties request.  */
        if (sample_properties_request_sent == NX_FALSE)
        {
            if ((status = nx_azure_iot_hub_client_device_twin_properties_request(&iothub_client, NX_WAIT_FOREVER)))
            {
                PRINTF("device twin document request failed!: error code = 0x%08x\r\n", status);
                continue;
            }

            if ((status = nx_azure_iot_hub_client_device_twin_properties_receive(&iothub_client, &packet_ptr, NX_WAIT_FOREVER)))
            {
                PRINTF("device twin document receive failed!: error code = 0x%08x\r\n", status);
                continue;
            }

            PRINTF("Receive twin properties :");
            printf_packet(packet_ptr);
            PRINTF("\r\n");
            nx_packet_release(packet_ptr);
            sample_properties_request_sent = NX_TRUE;
        }

        if ((status = nx_azure_iot_hub_client_device_twin_desired_properties_receive(&iothub_client, &packet_ptr,
                                                                                     NX_WAIT_FOREVER)))
        {
            PRINTF("Receive desired property receive failed!: error code = 0x%08x\r\n", status);
            continue;
        }

        PRINTF("Receive desired property call: ");
        printf_packet(packet_ptr);
        PRINTF("\r\n");
        nx_packet_release(packet_ptr);

        if ((status = nx_azure_iot_hub_client_device_twin_reported_properties_send(&iothub_client,
                                                                                   (UCHAR *)fixed_reported_properties, sizeof(fixed_reported_properties) - 1,
                                                                                   &request_id, &response_status,
                                                                                   &reported_property_version,
                                                                                   NX_WAIT_FOREVER)))
        {
            PRINTF("Device twin reported properties failed!: error code = 0x%08x\r\n", status);
            continue;
        }

        if ((response_status < 200) || (response_status >= 300))
        {
            PRINTF("device twin report properties failed with code : %d\r\n", response_status);
        }
    }
}
#endif /* DISABLE_DEVICE_TWIN_SAMPLE */
